import random

print("░█████╗░░█████╗░██╗███╗░░██╗  ███████╗██╗░░░░░██╗██████╗░")
print("██╔══██╗██╔══██╗██║████╗░██║  ██╔════╝██║░░░░░██║██╔══██╗")
print("██║░░╚═╝██║░░██║██║██╔██╗██║  █████╗░░██║░░░░░██║██████╔╝")
print("██║░░██╗██║░░██║██║██║╚████║  ██╔══╝░░██║░░░░░██║██╔═══╝░")
print("╚█████╔╝╚█████╔╝██║██║░╚███║  ██║░░░░░███████╗██║██║░░░░░")
print("░╚════╝░░╚════╝░╚═╝╚═╝░░╚══╝  ╚═╝░░░░░╚══════╝╚═╝╚═╝░░░░░")
print("         🄱 🅈   🅁 🅄 🅂 🄻 🄰 🄽 🄲 🄷 🅁")
print('Бот: Приветствую в казино "АЗИНО-777"!')
balance = int(input("Какую сумму вы хотите залить на баланс:\n>"))
stavka = int(input("Введите сумму ставки:\n>"))
coin=["Орел","Решка"]
while balance != 0:
    gamerchoice = int(input("Выберите сторону монетки: 1-Орел,2-Решка"+ "\n"+ ">"))
    choice = random.choice(coin)
    if gamerchoice == 1:
        if choice == "Орел":
            balance+=stavka
            print("Поздравляю, вы выиграли!\nВаш баланс:",balance)
        else:
            balance-=stavka
            print("Извините, но вы проиграли :(\nВаш баланс:",balance)
    else:
        if choice == "Решка":
            balance+=stavka
            print("Поздравляю, вы выиграли!\nВаш баланс:",balance)
        else:
            balance-=stavka
            print("Извините, но вы проиграли :(\nВаш баланс:",balance)
print("У вас закончились средства на счету!")
